console.log("\n");
console.log("Задача 3. Фільтрація масиву чисел");

// 1) Напиши функцію filterArray(numbers, value), яка приймає масив чисел (numbers) та значення (value) як параметри.

// 2) Функція повинна повертати новий масив лише тих чисел із масиву numbers, які більші за значення value.

// 3) Усередині функції:

// - Створи порожній масив, у який будеш додавати підходящі числа.
// - Використай цикл для ітерації кожного елемента масиву numbers.
// - Використовуй умовний оператор if усередині циклу для перевірки кожного елемента и додавання до свого масиву.
// - Поверни свій новий масив з підходящими числами як результат.

// ----------ПОКРОКОВО------------------------------------------------------------


function filterArray(numbers, value) {
// Створюємо пустий масив
    let result = [];
// Запускаємо цикл for...of, бо нам тільки перебрати цікл, міняти нічого не треба у старому масиві numbers.
    for (const number of numbers) {
// Задаємо умову порівняння номерів із параметром value
        if (number > value) {
            result.push(number);
        }
        
    }
// повертаємо результат
    return result;
}


console.log(filterArray([1, 2, 3, 4, 5], 3)); // [4, 5]
console.log(filterArray([1, 2, 3, 4, 5], 4)); // [5]
console.log(filterArray([1, 2, 3, 4, 5], 5)); // []
console.log(filterArray([12, 24, 8, 41, 76], 38)); // [41, 76]
console.log(filterArray([12, 24, 8, 41, 76], 20)); // [24, 41, 76]